In [1]:
import pandas as pd
import urllib.request as req
import json
import sqlalchemy
import psycopg2
import pymongo

### Задача 1

Using the MetaWeather service, find out what the weather was like in London on March 1, 2019. To do this, in the first cell, define the identifier of London in this service, and in the second cell, request weather data. Please note that the service will return data for several days, and not just for March 1, this is acceptable in this task.

In [2]:
url = "https://www.metaweather.com/api/location/search/?query=london"

In [3]:
with req.urlopen(url) as session:
    response1 = session.read().decode()
    data = json.loads(response1)
data[0]['woeid']

44418

In [6]:
url1 = 'https://www.metaweather.com/api/location/44418/2019/03/01/'
with req.urlopen(url1) as weather:
    response2 = weather.read().decode()
    data1 = json.loads(response2)
data1[0]

{'id': 4706336925286400,
 'weather_state_name': 'Showers',
 'weather_state_abbr': 's',
 'wind_direction_compass': 'W',
 'created': '2019-03-01T21:59:01.944736Z',
 'applicable_date': '2019-03-01',
 'min_temp': 7.593333333333334,
 'max_temp': 12.533333333333333,
 'the_temp': 12.055,
 'wind_speed': 4.989812600347968,
 'wind_direction': 271.4307338494283,
 'air_pressure': 1017.6800000000001,
 'humidity': 74,
 'visibility': 6.465988626421697,
 'predictability': 73}

###  2

Save the weather data obtained in the previous task to the `weather.json` file. When saving, use four spaces for formatting.

In [7]:
with open('weather.json', 'w') as file:
    json.dump(data1, file, indent=4)

###  3

Load the contents of the `weather.json` file into a DataFrame and print the first five lines of the DataFrame to the screen.

In [8]:
df = pd.read_json('weather.json')
df.head()

,id,weather_state_name,weather_state_abbr,wind_direction_compass,created,applicable_date,min_temp,max_temp,the_temp,wind_speed,wind_direction,air_pressure,humidity,visibility,predictability
0,4706336925286400,Showers,s,W,2019-03-01T21:59:01.944736Z,2019-03-01,7.593333,12.533333,12.055,4.989813,271.430734,1017.68,74,6.465989,73
1,5349522672713728,Showers,s,W,2019-03-01T18:57:01.981049Z,2019-03-01,7.593333,12.533333,12.055,5.207913,276.650124,1017.18,73,6.667624,73
2,4529216366313472,Showers,s,W,2019-03-01T15:55:02.886405Z,2019-03-01,7.593333,12.533333,12.055,5.207913,276.650124,1017.18,73,6.667624,73
3,4582457049350144,Showers,s,W,2019-03-01T12:53:01.886400Z,2019-03-01,7.593333,12.533333,12.055,5.207913,276.650124,1017.18,73,6.667624,73
4,6272821925773312,Showers,s,W,2019-03-01T09:51:02.485187Z,2019-03-01,7.593333,12.533333,12.185,4.531242,271.430734,1017.18,75,7.897628,73

###  4

Save the DataFrame from the previous task to the `result.csv` file. Use `index` as the name of the index column.

In [9]:
df.to_csv('result.csv', index_label='index')

###  5

Load the contents of the `ratings` SQL table into a DataFrame. Print the first five rows of the DataFrame to the screen. To connect to the database, use the connection string specified in the next cell.

In [10]:
conn = 'postgresql+psycopg2://readonly:6hajV34RTQfmxhS@dsstudents.skillbox.ru:5432/db_ds_students'
engine = sqlalchemy.create_engine(conn)
connect = engine.connect()

In [11]:
df1 = pd.read_sql('select * from ratings', connect)
df1

         userid  movieid  rating   timestamp
0          7757     1923     4.0  1254591556
1          7757     1961     3.5  1254591940
2          7757     1994     3.0  1195090468
3          7757     2003     2.0  1195602238
4          7757     2006     3.0  1195527579
...         ...      ...     ...         ...
1555547    7757     1876     3.5  1254592413
1555548    7757     1884     3.5  1332810502
1555549    7757     1900     4.5  1324332942
1555550    7757     1917     4.0  1254591837
1555551    7757     1921     3.5  1195602528

[1555552 rows x 4 columns]

###  6

Save the first 10000 dataframe records from the previous task to `result2.xlsx`, name the sheet `MySheet` when saving.

(Note: the `sheet_name` parameter is used to specify the sheet name in the Excel file both when reading and writing)

In [12]:
df2 = df1.head(10000)
df2.to_excel('result2.xlsx', sheet_name='MySheet')

###  7

Determine the number of documents in the `users` collection in MongoDB. If the number of documents is < 1000, then in the next cell, load the entire contents of this collection into a list and display the zero element of this list on the screen. To connect to MongoDB, use the connection string specified in the next cell.

In [13]:
conn = 'mongodb://students:X63673t47Gl03Sq@dsstudents.skillbox.ru:27017/?authSource=movies'
connect = pymongo.MongoClient(conn)
db = connect['movies']
users = db['users']
users.find().count()

<ipython-input-13-a16a8611b57d>:5: DeprecationWarning: count is deprecated. Use Collection.count_documents instead.
  users.find().count()

100

In [14]:
my_list = list(users.find())
my_list[0]

{'_id': ObjectId('5cc69095067496679c74f7a4'),
 'user_id': 'ed5da480-57a2-489c-8e68-512155ab9892',
 'first_name': 'Жанна',
 'last_name': 'Петрова',
 'mail': 'zhanna_03816@gmail.com',
 'age': 20.0}

###  8

Convert the list of all documents in the `users` collection from the previous task into a pandas DataFrame and save its contents to the file `result3.xlsx`.

In [15]:
df3 = pd.DataFrame(my_list)
df3.to_excel('result3.xlsx')

## Additional tasks

###  9

Using the data in the `ratings` SQL table, for each user (the `userid` column), determine the average rating that this user gave to movies. Display the result on the screen.

Grouping is carried out in two ways: using `GROUP BY` in the query string to the database and using the `groupby` method in pandas.

In [16]:
conn = 'postgresql+psycopg2://readonly:6hajV34RTQfmxhS@dsstudents.skillbox.ru:5432/db_ds_students'
engine = sqlalchemy.create_engine(conn)
connect = engine.connect()
df4 = pd.read_sql('select * from ratings', connect)
df4.groupby('userid')['rating'].mean()

userid
1       4.277778
2       3.318182
3       3.100000
4       3.500000
5       4.269231
          ...
7952    3.390244
7953    3.567568
7954    3.750000
7955    4.150000
7956    3.290640
Name: rating, Length: 7956, dtype: float64

In [17]:
df4 = pd.read_sql('select userid, avg(rating) from ratings group by userid', connect)
df4

      userid       avg
0       6114  4.000000
1       4790  4.000000
2        273  4.314685
3       3936  3.756757
4       5761  3.419220
...      ...       ...
7951    4827  2.828025
7952    7227  3.950000
7953     790  3.918605
7954    5642  4.026786
7955    2850  3.468750

[7956 rows x 2 columns]

###  10

Join the `ratings` and `keywords` tables on the `movieid` columns (use a left join). Merge in two ways: using `LEFT JOIN` in the query string to the database and using the `merge` method in pandas. Load the result of the union into a DataFrame and save it to the `result4.csv` file.

Note that when merging, columns may be duplicated. The resulting dataframe should not have such duplicate columns.

In [18]:
df_ratings = pd.read_sql('select * from ratings', connect)
df_ratings

         userid  movieid  rating   timestamp
0          7757     1923     4.0  1254591556
1          7757     1961     3.5  1254591940
2          7757     1994     3.0  1195090468
3          7757     2003     2.0  1195602238
4          7757     2006     3.0  1195527579
...         ...      ...     ...         ...
1555547    7757     1876     3.5  1254592413
1555548    7757     1884     3.5  1332810502
1555549    7757     1900     4.5  1324332942
1555550    7757     1917     4.0  1254591837
1555551    7757     1921     3.5  1195602528

[1555552 rows x 4 columns]

In [19]:
df_keywords = pd.read_sql('select * from keywords', connect)
df_keywords

       movieid                                               tags
0          862  [{'id': 931, 'name': 'jealousy'}, {'id': 4290,...
1         8844  [{'id': 10090, 'name': 'board game'}, {'id': 1...
2        15602  [{'id': 1495, 'name': 'fishing'}, {'id': 12392...
3        31357  [{'id': 818, 'name': 'based on novel'}, {'id':...
4        11862  [{'id': 1009, 'name': 'baby'}, {'id': 1599, 'n...
...        ...                                                ...
92833   439050             [{'id': 10703, 'name': 'tragic love'}]
92834   111109  [{'id': 2679, 'name': 'artist'}, {'id': 14531,...
92835    67758                                                 []
92836   227506                                                 []
92837   461257                                                 []

[92838 rows x 2 columns]

In [37]:
df5 = pd.read_sql('select * from ratings left join keywords on ratings.movieid = keywords.movieid', connect)
df5 = df5.loc[:, ~df5.columns.duplicated()]
df5

,userid,movieid,rating,timestamp,tags
0,7757,2028,3.5,1195526234,"[{'id': 392, 'name': 'england'}, {'id': 2350, ..."
1,7757,2028,3.5,1195526234,"[{'id': 392, 'name': 'england'}, {'id': 2350, ..."
2,7757,2117,4.0,1333052084,"[{'id': 836, 'name': 'resistance'}, {'id': 212..."
3,7757,2117,4.0,1333052084,"[{'id': 836, 'name': 'resistance'}, {'id': 212..."
4,7757,2294,3.5,1195090460,"[{'id': 886, 'name': 'film making'}, {'id': 16..."
...,...,...,...,...,...
2236573,7757,1673,4.5,1195602011,"[{'id': 10322, 'name': 'native american'}, {'i..."
2236574,7757,1900,4.5,1324332942,"[{'id': 279, 'name': 'usa'}, {'id': 1601, 'nam..."
2236575,7757,1900,4.5,1324332942,"[{'id': 279, 'name': 'usa'}, {'id': 1601, 'nam..."
2236576,7757,1921,3.5,1195602528,"[{'id': 1022, 'name': 'workaholic'}, {'id': 59..."
2236577,7757,1921,3.5,1195602528,"[{'id': 1022, 'name': 'workaholic'}, {'id': 59..."

In [21]:
df6 = df_ratings.merge(df_keywords)
df6

,userid,movieid,rating,timestamp,tags
0,7757,1923,4.0,1254591556,"[{'id': 703, 'name': 'detective'}, {'id': 739,..."
1,7757,1923,4.0,1254591556,"[{'id': 703, 'name': 'detective'}, {'id': 739,..."
2,7760,1923,3.0,1102272791,"[{'id': 703, 'name': 'detective'}, {'id': 739,..."
3,7760,1923,3.0,1102272791,"[{'id': 703, 'name': 'detective'}, {'id': 739,..."
4,7787,1923,0.5,1076872354,"[{'id': 703, 'name': 'detective'}, {'id': 739,..."
...,...,...,...,...,...
1361271,7713,38849,1.5,1343226427,"[{'id': 803, 'name': 'android'}, {'id': 9831, ..."
1361272,7732,54445,5.0,1465415042,"[{'id': 156788, 'name': 'swat team'}, {'id': 1..."
1361273,7732,54445,5.0,1465415042,"[{'id': 156788, 'name': 'swat team'}, {'id': 1..."
1361274,7732,54445,5.0,1465415042,"[{'id': 156788, 'name': 'swat team'}, {'id': 1..."
1361275,7732,54445,5.0,1465415042,"[{'id': 156788, 'name': 'swat team'}, {'id': 1..."

In [22]:
df6.to_csv('result4.csv')

AttributeError: 'Series' object has no attribute 'strcontains'